

const arrExample = ["피카츄", "라이츄", "파이리", "꼬부기", "버터풀", "야도란" , "피존투", "또가스", "우린", "서로", "모습은", "달라도"]

//forEach()

// let arr = ["피카츄", "라이츄", "파이리"];

// arr.forEach(function(value){
  
//   console.log(value);

// });


//push()

// 배열 뒷부분에 값을 삽입 

// let arr = ["피카츄", "라이츄", "파이리"];

// arr.push("꼬부기");

// console.log(arr);


//pop

// 배열 뒷부분 값을 삭제 

// let arr = ["피카츄", "라이츄", "파이리", "꼬부기", "버터풀", "야도란" , "피존투", "또가스", "우린", "서로", "모습은", "달라도"]

// arr.pop();

// console.log(arr);


// shift()

// 배열 앞부분 값을 삭제 

// let arr = ["피카츄", "라이츄", "파이리", "꼬부기", "버터풀", "야도란" , "피존투", "또가스", "우린", "서로", "모습은", "달라도"]

// arr.shift();

// console.log(arr);


// unshift()

// 배열 앞부분 값을 삽입

// let arr = ["피카츄", "라이츄", "파이리", "꼬부기"]

// arr.unshift('포켓몬');

// console.log(arr);


//* indexOf() 나중에



// splice()

// 배열의 특정 위치에 추가하거나 삭제 
// (지정배열, 지정배열에 몇번까지 삭제, 지정배열에 몇번까지 삭제에 추가)

// let arr = ["피카츄", "라이츄", "파이리", "꼬부기", "버터풀", "야도란" , "피존투"]

// arr.splice(1, 3, "a", "b");

// console.log(arr);


// slice()

// 배열 첫부분부터 시작 / (-숫자)를 하면 배열 마지막에서 그 숫자만큼 추출
// 배열 끝부분부터 시작 / ex)(2,-1)이면 세번째부터 끝에서 두번째를 추출

// let arr = ["피카츄", "라이츄", "파이리", "꼬부기", "버터풀", "야도란" , "피존투"]

// let arr1 = arr.slice(2,-1);

// console.log(arr1);


//from()

// let arr = Array.from("12345678910");

// console.log(arr);


//isArray()







